Revit 2024 API
RebarShape.HigherEnd Property
 Defines the higher end of rebar shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2009
Syntax
C#
public int HigherEnd { get; }
Visual Basic
Public ReadOnly Property HigherEnd As Integer
	Get
Visual C++
public:
property int HigherEnd {
	int get ();
}
Remarks
 Change this property will make rebar shape's start and end hooks swap.
See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace